yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/clk_reg.h
/**************************************************************************//**
 * @file     clk_reg.h
 * @version  V1.00
 * @brief    CLK register definition header file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2025 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
#ifndef __CLK_REG_H__
#define __CLK_REG_H__

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/** @addtogroup REGISTER Control Register

  @{

*/


/*---------------------- System Clock Controller -------------------------*/
/**
    @addtogroup CLK System Clock Controller(CLK)
    Memory Mapped Structure for CLK Controller
@{ */

typedef struct
{


/**
 * @var CLK_T::PMCON
 * Offset: 0x00  Power Management Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |HXT_EN    |HXT Crystal Power-down Control
 * |        |          |0 = HXT Crystal off (Power-down mode).
 * |        |          |1 = HXT Crystal on (Normal operating mode).
 * |[1]     |HXT_CTL   |Pre-scalar Counter Enable Bit
 * |        |          |Crystal pre-divide control for Wake-up from Power-down mode The chip will delay 256 x pre-scalar cycles after the reset signal to wait the Crystal to stable
 * |        |          |0 = The pre-scalar counter Disabled (assume the crystal is stable).
 * |        |          |1 = The pre-scalar counter Enabled.
 * |[23:8]  |PRESCALE  |Pre-scalar Counter
 * |        |          |Assume the crystal is stable after the Pre-Scalar x 256 crystal cycles
 * |        |          |Clock controller wouldnu2019t output clock to system before the counter reaching (pre-scalar x 256).
 * @var CLK_T::HCLKEN0
 * Offset: 0x10  AHB Devices Clock Enable Control Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |CPUCKEN   |Arm926EJ-S CPU Clock Enable Bit
 * |        |          |0 = Arm926EJ-S CPU clock Disabled.
 * |        |          |1 = Arm926EJ-S CPU clock Enabled.
 * |[1]     |HCLKCKEN  |Internal AHB Bus Clock Enable Bit
 * |        |          |0 = Internal AHB bus clock Disabled.
 * |        |          |1 = Internal AHB bus clock Enabled.
 * |[2]     |HCLK1CKEN |Internal AHB-1 Bus Clock Enable Bit
 * |        |          |0 = Internal AHB-1 bus clock Disabled.
 * |        |          |1 = Internal AHB-1 bus clock Enabled.
 * |[6]     |CLKOCKEN  |Reference Clock Output Enable Bit
 * |        |          |0 = Reference clock output Disabled.
 * |        |          |1 = Reference clock output Enabled.
 * |[8]     |SRAMCKEN  |SRAM Controller Clock Enable Bit
 * |        |          |0 = SRAM controller clock Disabled.
 * |        |          |1 = SRAM controller clock Enabled.
 * |[9]     |EBICKEN   |EBI Controller Clock Enable Bit
 * |        |          |0 = EBI controller clock Disabled.
 * |        |          |1 = EBI controller clock Enabled.
 * |[10]    |SDICCKEN  |SDIC Clock Enable Bit
 * |        |          |0 = DDR clock Disabled.
 * |        |          |1 = DDR clock Enabled.
 * |[11]    |GPIOCKEN  |GPIO Clock Enable Bit
 * |        |          |0 = GPIO clock Disabled.
 * |        |          |1 = GPIO clock Enabled.
 * |[12]    |PCLK0CKEN |Internal APB-0 Bus Clock Enable Bit
 * |        |          |0 = Internal APB-1 bus clock Disabled.
 * |        |          |1 = Internal APB-1 bus clock Enabled.
 * |[13]    |PCLK1CKEN |Internal APB-1 Bus Clock Enable Bit
 * |        |          |0 = Internal APB-1 bus clock Disabled.
 * |        |          |1 = Internal APB-1 bus clock Enabled.
 * |[14]    |PCLK2CKEN |Internal APB-2 Bus Clock Enable Bit
 * |        |          |0 = Internal APB-2 bus clock Disabled.
 * |        |          |1 = Internal APB-2 bus clock Enabled.
 * |[15]    |PCLK3CKEN |Internal APB-3 Bus Clock Enable Bit
 * |        |          |0 = Internal APB-3 bus clock Disabled.
 * |        |          |1 = Internal APB-3 bus clock Enabled.
 * |[16]    |PDMA0EN   |PDMA 0 Clock Enable Bit
 * |        |          |0 = PDMA 0 clock Disabled.
 * |        |          |1 = PDMA 0 clock Enabled.
 * |[17]    |PDMA1EN   |PDMA 1 Clock Enable Bit
 * |        |          |0 = PDMA 1 clock Disabled.
 * |        |          |1 = PDMA 1 clock Enabled.
 * |[18]    |EMAC0EN   |Ethernet MAC Controller 0 Clock Enable Bit
 * |        |          |0 = Ethernet MAC controller 0 clock Disabled.
 * |        |          |1 = Ethernet MAC controller 0 clock Enabled.
 * |[19]    |EMAC1EN   |Ethernet MAC Controller 1 Clock Enable Bit
 * |        |          |0 = Ethernet MAC controller 1 clock Disabled.
 * |        |          |1 = Ethernet MAC controller 1 clock Enabled.
 * |[21]    |NANDEN    |NAND Engine Clock Enable Bit
 * |        |          |0 = NAND controller clock Disabled.
 * |        |          |1 = NAND controller clock Enabled.
 * |[22]    |SDH0EN    |SD Card Controller 0 Clock Enable Bit
 * |        |          |0 = SD card controller 0 clock Disabled.
 * |        |          |1 = SD card controller 0 clock Enabled.
 * |[23]    |SDH1EN    |SD Card Controller 1 Clock Enable Bit
 * |        |          |0 = SD card controller 1 clock Disabled.
 * |        |          |1 = SD card controller 1 clock Enabled.
 * |[24]    |USBHEN    |USB Host Controller Clock Enable Bit
 * |        |          |0 = USB host controller clock Disabled.
 * |        |          |1 = USB host controller clock Enabled.
 * |[25]    |USBDEN    |USB Device Controller Clock Enable Bit
 * |        |          |0 = USB device controller clock Disabled.
 * |        |          |1 = USB device controller clock Enabled.
 * @var CLK_T::HCLKEN1
 * Offset: 0x14  AHB Devices Clock Enable Control Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |I2SCKEN   |I2S Controller Clock Enable Bit
 * |        |          |0 = I2S controller clock Disabled.
 * |        |          |1 = I2S controller clock Enabled.
 * |[1]     |CRPTCKEN  |Cryptographic Accelerator Clock Enable Bit
 * |        |          |0 = Cryptographic Accelerator clock Disabled.
 * |        |          |1 = Cryptographic Accelerator clock Enabled.
 * |[2]     |KSCKEN    |Key Store Clock Enable Bit
 * |        |          |0 = Key store clock Disabled.
 * |        |          |1 = Key store clock Enabled.
 * |[3]     |OTPIDLE   |OTP Clock Enable Bit
 * |        |          |0 = OTP clock Disabled when chip is under IDLE mode.
 * |        |          |1 = OTP clock Enabled when chip is under IDLE mode.
 * |[8]     |CANF0CKEN |CANFD0 Clock Enable Bit
 * |        |          |0 = CANFD0 clock Disabled.
 * |        |          |1 = CANFD0 clock Enabled.
 * |[9]     |CANF1CKEN |CANFD1 Clock Enable Bit
 * |        |          |0 = CANFD1 clock Disabled.
 * |        |          |1 = CANFD1 clock Enabled.
 * |[10]    |CANF2CKEN |CANFD2 Clock Enable Bit
 * |        |          |0 = CANFD2 clock Disabled.
 * |        |          |1 = CANFD2 clock Enabled.
 * |[11]    |CANF3CKEN |CANFD3 Clock Enable Bit
 * |        |          |0 = CANFD3 clock Disabled.
 * |        |          |1 = CANFD3 clock Enabled.
 * |[16]    |CANRAM0EN |CANFD0 Message SRAM Clock Enable Bit
 * |        |          |0 = CANFD0 Message SRAM clock Disabled.
 * |        |          |1 = CANFD0 Message SRAM clock Enabled.
 * |[17]    |CANRAM1EN |CANFD1 Message SRAM Clock Enable Bit
 * |        |          |0 = CANFD1 Message SRAM clock Disabled.
 * |        |          |1 = CANFD1 Message SRAM clock Enabled.
 * |[18]    |CANRAM2EN |CANFD2 Message SRAM Clock Enable Bit
 * |        |          |0 = CANFD0 Message SRAM clock Disabled.
 * |        |          |1 = CANFD0 Message SRAM clock Enabled.
 * |[19]    |CANRAM3EN |CANFD3 Message SRAM Clock Enable Bit
 * |        |          |0 = CANFD3 Message SRAM clock Disabled.
 * |        |          |1 = CANFD3 Message SRAM clock Enabled.
 * @var CLK_T::PCLKEN0
 * Offset: 0x18  APB Devices Clock Enable Control Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |WDTCKEN   |Watch-dog Clock Enable Bit
 * |        |          |0 = Watch-dog clock Disabled.
 * |        |          |1 = Watch-dog clock Enabled.
 * |        |          |Note: If WDT default Enabled (WDTON(SYS_PWRON[3])=1), this bit is read-only and read back value is always 1.
 * |[1]     |WWDTCKEN  |Windowed Watch-dog Clock Enable Bit
 * |        |          |0 = Windowed Watch-dog clock Disabled.
 * |        |          |1 = Windowed Watch-dog clock Enabled.
 * |[2]     |RTCCKEN   |RTC Clock Enable Bit
 * |        |          |0 = RTC clock Disabled.
 * |        |          |1 =RTC clock Enabled.
 * |[3]     |AICCKEN   |Advanced Interrupt Controller Clock Enable Bit
 * |        |          |0 = AIC clock Disabled.
 * |        |          |1 = AIC clock Enabled.
 * |[8]     |TMR0CKEN  |Timer 0 Clock Enable Bit
 * |        |          |0 = Timer 0 clock Disabled.
 * |        |          |1 = Timer 0 clock Enabled.
 * |[9]     |TMR1CKEN  |Timer 1 Clock Enable Bit
 * |        |          |0 = Timer 1 clock Disabled.
 * |        |          |1 = Timer 1 clock Enabled.
 * |[10]    |TMR2CKEN  |Timer 2 Clock Enable Bit
 * |        |          |0 = Timer 2 clock Disabled.
 * |        |          |1 = Timer 2 clock Enabled.
 * |[11]    |TMR3CKEN  |Timer 3 Clock Enable Bit
 * |        |          |0 = Timer 3 clock Disabled.
 * |        |          |1 = Timer 3 clock Enabled.
 * |[12]    |TMR4CKEN  |Timer 4 Clock Enable Bit
 * |        |          |0 = Timer 4 clock Disabled.
 * |        |          |1 = Timer 4 clock Enabled.
 * |[13]    |TMR5CKEN  |Timer 5 Clock Enable Bit
 * |        |          |0 = Timer 5 clock Disabled.
 * |        |          |1 = Timer 5 clock Enabled.
 * |[16]    |UART0CKEN |UART 0 Clock Enable Bit
 * |        |          |0 = UART 0 clock Disabled.
 * |        |          |1 = UART 0 clock Enabled.
 * |[17]    |UART1CKEN |UART 1 Clock Enable Bit
 * |        |          |0 = UART 1 clock Disabled.
 * |        |          |1 = UART 1 clock Enabled.
 * |[18]    |UART2CKEN |UART 2 Clock Enable Bit
 * |        |          |0 = UART 2 clock Disabled.
 * |        |          |1 = UART 2 clock Enabled.
 * |[19]    |UART3CKEN |UART 3 Clock Enable Bit
 * |        |          |0 = UART 3 clock Disabled.
 * |        |          |1 = UART 3 clock Enabled.
 * |[20]    |UART4CKEN |UART 4 Clock Enable Bit
 * |        |          |0 = UART 4 clock Disabled.
 * |        |          |1 = UART 4 clock Enabled.
 * |[21]    |UART5CKEN |UART 5 Clock Enable Bit
 * |        |          |0 = UART 5 clock Disabled.
 * |        |          |1 = UART 5 clock Enabled.
 * |[22]    |UART6CKEN |UART 6 Clock Enable Bit
 * |        |          |0 = UART 6 clock Disabled.
 * |        |          |1 = UART 6 clock Enabled.
 * |[23]    |UART7CKEN |UART 7 Clock Enable Bit
 * |        |          |0 = UART 7 clock Disabled.
 * |        |          |1 = UART 7 clock Enabled.
 * |[24]    |UART8CKEN |UART 8 Clock Enable Bit
 * |        |          |0 = UART 8 clock Disabled.
 * |        |          |1 = UART 8 clock Enabled.
 * |[25]    |UART9CKEN |UART 9 Clock Enable Bit
 * |        |          |0 = UART 9 clock Disabled.
 * |        |          |1 = UART 9 clock Enabled.
 * @var CLK_T::PCLKEN1
 * Offset: 0x1C  APB Devices Clock Enable Control Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |I2C0CKEN  |I2C 0 Clock Enable Bit
 * |        |          |0 = I2C 0 clock Disabled.
 * |        |          |1 = I2C 0 clock Enabled.
 * |[1]     |I2C1CKEN  |I2C 1 Clock Enable Bit
 * |        |          |0 = I2C 1 clock Disabled.
 * |        |          |1 = I2C 1 clock Enabled.
 * |[2]     |I2C2CKEN  |I2C 2 Clock Enable Bit
 * |        |          |0 = I2C 2 clock Disabled.
 * |        |          |1 = I2C 2 clock Enabled.
 * |[3]     |I2C3CKEN  |I2C 3 Clock Enable Bit
 * |        |          |0 = I2C 3 clock Disabled.
 * |        |          |1 = I2C 3 clock Enabled.
 * |[4]     |SPI0CKEN  |SPI 0 Clock Enable Bit
 * |        |          |0 = SPI 0 clock Disabled.
 * |        |          |1 = SPI 0 clock Enabled.
 * |[5]     |SPI1CKEN  |SPI 1 Clock Enable Bit
 * |        |          |0 = SPI 1 clock Disabled.
 * |        |          |1 = SPI 1 clock Enabled.
 * |[6]     |SPI2CKEN  |SPI 2 Clock Enable Bit
 * |        |          |0 = SPI 2 clock Disabled.
 * |        |          |1 = SPI 2 clock Enabled.
 * |[7]     |SPI3CKEN  |SPI 3 Clock Enable Bit
 * |        |          |0 = SPI 3 clock Disabled.
 * |        |          |1 = SPI 3 clock Enabled.
 * |[8]     |CAN0CKEN  |CAN 0 Clock Enable Bit
 * |        |          |0 = CAN 0 clock Disabled.
 * |        |          |1 = CAN 0 clock Enabled.
 * |[9]     |CAN1CKEN  |CAN 1 Clock Enable Bit
 * |        |          |0 = CAN 1 clock Disabled.
 * |        |          |1 = CAN 1 clock Enabled.
 * |[10]    |CAN2CKEN  |CAN 2 Clock Enable Bit
 * |        |          |0 = CAN 2 clock Disabled.
 * |        |          |1 = CAN 2 clock Enabled.
 * |[11]    |CAN3CKEN  |CAN 3 Clock Enable Bit
 * |        |          |0 = CAN 3 clock Disabled.
 * |        |          |1 = CAN 3 clock Enabled.
 * |[16]    |SMC0CKEN  |Smart Card Interface 0 Clock Enable Bit
 * |        |          |0 = Smart Card interface 0 clock Disabled.
 * |        |          |1 = Smart Card interface 0 clock Enabled.
 * |[17]    |SMC1CKEN  |Smart Card Interface 1 Clock Enable Bit
 * |        |          |0 = Smart Card interface 1 clock Disabled.
 * |        |          |1 = Smart Card interface 1 clock Enabled.
 * |[20]    |QSPI0CKEN |QSPI 0 Clock Enable Bit
 * |        |          |0 = QSPI 0 clock Disabled.
 * |        |          |1 = QSPI 0 clock Enabled.
 * |[24]    |ADCCKEN   |ADC Controller Clock Enable Bit
 * |        |          |0 = ADC controller clock Disabled.
 * |        |          |1 = ADC controller clock Enabled.
 * |[25]    |EADCCKEN  |EADC Controller Clock Enable Bit
 * |        |          |0 = EADC controller clock Disabled.
 * |        |          |1 = EADC controller clock Enabled.
 * |[26]    |BPWM0CKEN |BPWM 0 Clock Enable Bit
 * |        |          |0 = BPWM 0 clock Disabled.
 * |        |          |1 = BPWM 0 clock Enabled.
 * |[27]    |BPWM1CKEN |BPWM 1 Clock Enable Bit
 * |        |          |0 = BPWM 1 clock Disabled.
 * |        |          |1 = BPWM 1 clock Enabled.
 * @var CLK_T::DIVCTL0
 * Offset: 0x20  Clock Divider Control Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[4:3]   |SYSTEM_S  |System Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of system clock SYS_CLK.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Reserved.
 * |        |          |10 = Clock source from APLL.
 * |        |          |11 = Clock source from UPLL.
 * |[8]     |CPUDIV2EN |CPU Clock Divided by 2 Enable Bit
 * |        |          |This field defines if CPUCLK for Arm926EJ-S CPU is SYS_CLK devided by 2 or not.
 * |        |          |0 = The frequency of CPUCLK is SYS_CLK.
 * |        |          |1 = The frequency of CPUCLK is SYS_CLK /2.
 * |[18:16] |PCLK3DIV  |PCLK3 Clock Divider
 * |        |          |APB3 clock can be divided from the PCLK3 clock source.
 * |        |          |000 = PCLK3 frequency is PCLK3 clock source frequency.
 * |        |          |001 = PCLK3 frequency is (PCLK3 clock source frequency) /2.
 * |        |          |010 = PCLK3 frequency is (PCLK3 clock source frequency) /4.
 * |        |          |011 = PCLK3 frequency is (PCLK3 clock source frequency) /8.
 * |        |          |100 = PCLK3 frequency is (PCLK3 clock source frequency) /16.
 * |        |          |101 = PCLK3 frequency is (PCLK3 clock source frequency) /32.
 * |        |          |110 = PCLK3 frequency is (PCLK3 clock source frequency) /64.
 * |        |          |Others = Reserved.
 * |[20:19] |PCLK3_S   |PCLK3 Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of PCLK3.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from HCLK.
 * |        |          |10 = Clock source from APLL/2.
 * |        |          |11 = Clock source from UPLL/2.
 * @var CLK_T::DIVCTL1
 * Offset: 0x24  Clock Divider Control Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[20:19] |I2S_S     |I2S Controller Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for I2S controller.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Reserved.
 * |        |          |10 = Clock source from APLL.
 * |        |          |11 = Clock source from UPLL/2.
 * |[31:24] |I2S_N     |I2S Controller Clock Divider
 * |        |          |This field defines the clock divide number for clock divider to generate the engine clock for I2S controller.
 * |        |          |I2S clock frequency = (I2S clock source frequency) / (I2S_N + 1).
 * @var CLK_T::DIVCTL2
 * Offset: 0x28  Clock Divider Control Register 2
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |CANFD0_S  |CANFD 0 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for CANFD0.
 * |        |          |0 = Clock source from APLL/2.
 * |        |          |1 = Clock source from UPLL/2.
 * |[1]     |CANFD1_S  |CANFD 1 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for CANFD1.
 * |        |          |0 = Clock source from APLL/2.
 * |        |          |1 = Clock source from UPLL/2.
 * |[2]     |CANFD2_S  |CANFD 2 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for CANFD2.
 * |        |          |0 = Clock source from APLL/2.
 * |        |          |1 = Clock source from UPLL/2.
 * |[3]     |CANFD3_S  |CANFD 3 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for CANFD3.
 * |        |          |0 = Clock source from APLL/2.
 * |        |          |1 = Clock source from UPLL/2.
 * |[9:8]   |QSPI0_S   |QSPI 0 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for QSPI0.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from PCLK0.
 * |        |          |10 = Clock source from APLL/2.
 * |        |          |11 = Clock source from UPLL/2.
 * |[11:10] |SPI0_S    |SPI 0 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for SPI0.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from PCLK0.
 * |        |          |10 = Clock source from APLL/2.
 * |        |          |11 = Clock source from UPLL/2.
 * |[13:12] |SPI1_S    |SPI 1 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for SPI1.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from PCLK1.
 * |        |          |10 = Clock source from APLL/2.
 * |        |          |11 = Clock source from UPLL/2.
 * |[15:14] |SPI2_S    |SPI 2 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for SPI2.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from PCLK0.
 * |        |          |10 = Clock source from APLL/2.
 * |        |          |11 = Clock source from UPLL/2.
 * |[17:16] |SPI3_S    |SPI 3 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for SPI3.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from PCLK1.
 * |        |          |10 = Clock source from APLL/2.
 * |        |          |11 = Clock source from UPLL/2.
 * @var CLK_T::DIVCTL3
 * Offset: 0x2C  Clock Divider Control Register 3
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[4:3]   |SD0_S     |SD Card Controller 0 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for SD card controller 0.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Reserved.
 * |        |          |10 = Clock source from APLL/2.
 * |        |          |11 = Clock source from UPLL/2.
 * |[15:5]  |SD0_N     |SD Card Controller 0 Engine Clock Divider
 * |        |          |This field defines the clock divide number for clock divider to generate the engine clock for SD card controller 0.
 * |        |          |SD0 clock frequency = (SD0 clock source frequency) / (SD0_N + 1).
 * |[20:19] |SD1_S     |SD Card Controller 1 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for SD card controller 1.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Reserved.
 * |        |          |10 = Clock source from APLL/2.
 * |        |          |11 = Clock source from UPLL/2.
 * |[31:21] |SD1_N     |SD Card Controller 1 Engine Clock Divider
 * |        |          |This field defines the clock divide number for clock divider to generate the engine clock for SD card controller 1.
 * |        |          |SD1 clock frequency = (SD1 clock source frequency) / (SD1_N + 1).
 * @var CLK_T::DIVCTL4
 * Offset: 0x30  Clock Divider Control Register 4
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[4:3]   |UART0_S   |UART0 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for UART0 controller.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from LXT.
 * |        |          |10 = Clock source from APLL/2.
 * |        |          |11 = Clock source from UPLL/2.
 * |[7:5]   |UART0_N   |UART0 Engine Clock Divider
 * |        |          |This field defines the clock divide number for clock divider to generate the engine clock for UART0.
 * |        |          |UART0 clock frequency = (UART0 clock source frequency) / (UART0_N + 1).
 * |[12:11] |UART1_S   |UART1 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for UART1 controller.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from LXT.
 * |        |          |10 = Clock source from APLL/2.
 * |        |          |11 = Clock source from UPLL/2.
 * |[15:13] |UART1_N   |UART1 Engine Clock Divider
