yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/clk_reg.h
 * |        |          |This field defines the clock divide number for clock divider to generate the engine clock for UART1.
 * |        |          |UART1 clock frequency = (UART1 clock source frequency) / (UART1_N + 1).
 * |[20:19] |UART2_S   |UART2 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for UART2 controller.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from LXT.
 * |        |          |10 = Clock source from APLL/2.
 * |        |          |11 = Clock source from UPLL/2.
 * |[23:21] |UART2_N   |UART2 Engine Clock Divider
 * |        |          |This field defines the clock divide number for clock divider to generate the engine clock for UART2.
 * |        |          |UART2 clock frequency = (UART2 clock source frequency) / (UART2_N + 1).
 * |[28:27] |UART3_S   |UART3 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for UART3 controller.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from LXT.
 * |        |          |10 = Clock source from APLL/2.
 * |        |          |11 = Clock source from UPLL/2.
 * |[31:29] |UART3_N   |UART3 Engine Clock Divider
 * |        |          |This field defines the clock divide number for clock divider to generate the engine clock for UART3.
 * |        |          |UART3 clock frequency = (UART3 clock source frequency) / (UART3_N + 1).
 * @var CLK_T::DIVCTL5
 * Offset: 0x34  Clock Divider Control Register 5
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[4:3]   |UART4_S   |UART4 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for UART4 controller.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from LXT.
 * |        |          |10 = Clock source from APLL/2.
 * |        |          |11 = Clock source from UPLL/2.
 * |[7:5]   |UART4_N   |UART4 Engine Clock Divider
 * |        |          |This field defines the clock divide number for clock divider to generate the engine clock for UART4.
 * |        |          |UART4 clock frequency = (UART4 clock source frequency) / (UART4_N + 1).
 * |[12:11] |UART5_S   |UART5 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for UART5 controller.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from LXT.
 * |        |          |10 = Clock source from APLL/2.
 * |        |          |11 = Clock source from UPLL/2.
 * |[15:13] |UART5_N   |UART5 Engine Clock Divider
 * |        |          |This field defines the clock divide number for clock divider to generate the engine clock for UART5.
 * |        |          |UART5 clock frequency = (UART5 clock source frequency) / (UART5_N + 1).
 * |[20:19] |UART6_S   |UART6 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for UART6 controller.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from LXT.
 * |        |          |10 = Clock source from APLL/2.
 * |        |          |11 = Clock source from UPLL/2.
 * |[23:21] |UART6_N   |UART6 Engine Clock Divider
 * |        |          |This field defines the clock divide number for clock divider to generate the engine clock for UART6.
 * |        |          |UART6 clock frequency = (UART6 clock source frequency) / (UART6_N + 1).
 * |[28:27] |UART7_S   |UART7 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for UART7 controller.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from LXT.
 * |        |          |10 = Clock source from APLL/2.
 * |        |          |11 = Clock source from UPLL/2.
 * |[31:29] |UART7_N   |UART7 Engine Clock Divider
 * |        |          |This field defines the clock divide number for clock divider to generate the engine clock for UART7.
 * |        |          |UART7 clock frequency = (UART7 clock source frequency) / (UART7_N + 1).
 * @var CLK_T::DIVCTL6
 * Offset: 0x38  Clock Divider Control Register 6
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[4:3]   |UART8_S   |UART8 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for UART8 controller.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from LXT.
 * |        |          |10 = Clock source from APLL/2.
 * |        |          |11 = Clock source from UPLL/2.
 * |[7:5]   |UART8_N   |UART8 Engine Clock Divider
 * |        |          |This field defines the clock divide number for clock divider to generate the engine clock for UART8.
 * |        |          |UART8 clock frequency = (UART8 clock source frequency) / (UART8_N + 1).
 * |[12:11] |UART9_S   |UART9 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for UART9 controller.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from LXT.
 * |        |          |10 = Clock source from APLL/2.
 * |        |          |11 = Clock source from UPLL/2.
 * |[15:13] |UART9_N   |UART9 Engine Clock Divider
 * |        |          |This field defines the clock divide number for clock divider to generate the engine clock for UART9.
 * |        |          |UART9 clock frequency = (UART9 clock source frequency) / (UART9_N + 1).
 * |[23:16] |EADC_N    |EADC Engine Clock Divider
 * |        |          |This field defines the clock divide number for clock divider to generate the engine clock for EADC.
 * |        |          |EADC clock frequency = (EADC clock source frequency) / (EADC_N + 1).
 * |[27:24] |SMC0_N    |Smart Card 0 Engine Clock Divider
 * |        |          |This field defines the clock divide number for clock divider to generate the engine clock for Smart card controller.
 * |        |          |SMC0 clock frequency = (SMC0 clock source frequency) / (SMC0_N + 1).
 * |[31:28] |SMC1_N    |Smart Card 1 Engine Clock Divider
 * |        |          |This field defines the clock divide number for clock divider to generate the engine clock for Smart card controller.
 * |        |          |SMC1 clock frequency = (SMC1 clock source frequency) / (SMC1_N + 1).
 * @var CLK_T::DIVCTL7
 * Offset: 0x3C  Clock Divider Control Register 7
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |CANFD0_N  |CANFD0 Engine Clock Divider
 * |        |          |This field defines the clock divide number for clock divider to generate the engine clock for CANFD0.
 * |        |          |CANFD0 clock frequency = (CANFD0 clock source frequency) / (CANFD0_N + 1).
 * |[7:4]   |CANFD1_N  |CANFD1 Engine Clock Divider
 * |        |          |This field defines the clock divide number for clock divider to generate the engine clock for CANFD1.
 * |        |          |CANFD1 clock frequency = (CANFD1 clock source frequency) / (CANFD1_N + 1).
 * |[11:8]  |CANFD2_N  |CANFD2 Engine Clock Divider
 * |        |          |This field defines the clock divide number for clock divider to generate the engine clock for CANFD2.
 * |        |          |CANFD2 clock frequency = (CANFD2 clock source frequency) / (CANFD2_N + 1).
 * |[15:12] |CANFD3_N  |CANFD3 Engine Clock Divider
 * |        |          |This field defines the clock divide number for clock divider to generate the engine clock for CANFD3.
 * |        |          |CANFD3 clock frequency = (CANFD3 clock source frequency) / (CANFD3_N + 1).
 * |[21:20] |ADC_S     |ADC Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for ADC controller.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Reserved.
 * |        |          |10 = Clock source from APLL/2.
 * |        |          |11 = Clock source from UPLL/2.
 * |[31:24] |ADC_N     |ADC Engine Clock Divider
 * |        |          |This field defines the clock divide number for clock divider to generate the engine clock for ADC.
 * |        |          |ADC clock frequency = (ADC clock source frequency) / (ADC_N + 1).
 * @var CLK_T::DIVCTL8
 * Offset: 0x40  Clock Divider Control Register 8
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |MDCLKDIV  |MII Management Interface Clock
 * |        |          |This field defines the clock divide number for clock divider to generate the clock for MII management interface.
 * |        |          |MDCLK clock frequency = HCLK / (MDCLK_N + 1).
 * |[9:8]   |WDTSEL    |WDT Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for WDT controller.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from HXT/512.
 * |        |          |10 = Clock source from PCLK2/4096.
 * |        |          |11 = Clock source from 32.768 kHz.
 * |[11:10] |WWDTSEL   |WWDT Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for WWDT controller.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from HXT/512.
 * |        |          |10 = Clock source from PCLK2/4096.
 * |        |          |11 = Clock source from 32.768 kHz.
 * |[17:16] |TMR0SEL   |Timer 0 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for Timer 0 controller.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from PCLK0/2.
 * |        |          |10 = Clock source from PCLK0/4096.
 * |        |          |11 = Clock source from 32.768 kHz.
 * |[19:18] |TMR1SEL   |Timer 1 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for Timer 1 controller.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from PCLK0/2.
 * |        |          |10 = Clock source from PCLK0/4096.
 * |        |          |11 = Clock source from 32.768 kHz.
 * |[21:20] |TMR2SEL   |Timer 2 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for Timer 2 controller.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from PCLK1/2.
 * |        |          |10 = Clock source from PCLK1/4096.
 * |        |          |11 = Clock source from 32.768 kHz.
 * |[23:22] |TMR3SEL   |Timer 3 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for Timer 3 controller.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from PCLK1/2.
 * |        |          |10 = Clock source from PCLK1/4096.
 * |        |          |11 = Clock source from 32.768 kHz.
 * |[25:24] |TMR4SEL   |Timer 4 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for Timer 4 controller.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from PCLK0/2.
 * |        |          |10 = Clock source from PCLK0/4096.
 * |        |          |11 = Clock source from 32.768 kHz.
 * |[27:26] |TMR5SEL   |Timer 5 Engine Clock Source Selection
 * |        |          |This field selects which clock is used to be the source of engine clock for Timer 5 controller.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from PCLK0/2.
 * |        |          |10 = Clock source from PCLK0/4096.
 * |        |          |11 = Clock source from 32.768 kHz.
 * @var CLK_T::DIVCTL9
 * Offset: 0x44  Clock Divider Control Register 9
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[20:19] |CKO_S     |Reference Clock Out Source Selection
 * |        |          |This field selects which clock is used to be the source of reference clock output.
 * |        |          |00 = Clock source from HXT.
 * |        |          |01 = Clock source from LXT.
 * |        |          |10 = Clock source from APLL.
 * |        |          |11 = Clock source from UPLL.
 * |[31:24] |CKO_N     |Reference Clock Out Divide
 * |        |          |This field defines the clock divide number for clock divider to generate the reference clock output
 * |        |          |CKO clock frequency = (CKO clock source frequency) / (CKO_N + 1).
 * @var CLK_T::APLLCON
 * Offset: 0x60  APLL Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[6:0]   |FB_DV     |PLL VCO Output Clock Feedback Divider Integer Part
 * |        |          |Set the feedback divider factor (N) from 1 to 128.
 * |        |          |The N = FB_DV[6:0] + 1.
 * |[12:7]  |IN_DV     |Reference Input Divider
 * |        |          |Set the reference divider factor (M) from 1 to 64.
 * |        |          |The M = IN_DV[5:0] + 1.
 * |[15:13] |OUT_DV    |PLL Output Divider
 * |        |          |Set the output divider factor (P) from 1 to 8.
 * |        |          |The P = OUT_DV[2:0] + 1.
 * |[27:16] |FRAC      |PLL VCO Output Clock Feedback Divider Fraction Part
 * |        |          |Set the fraction part (X) of feedback divider factor.
 * |        |          |Write a non-zero value to this field enables the fraction mode automatically
 * |        |          |Please keep this field in 0x0 if donu2019t want to use the PLL fraction mode.
 * |        |          |The X = FRAC[11:0] / 212.
 * |[28]    |PD        |Power-down mode Enable Bit
 * |        |          |0 = PLL is in normal operation mode.
 * |        |          |1 = PLL is in Power-down mode (Default).
 * |[29]    |BYPASS    |Bypass Mode Enable Bit
 * |        |          |0 = PLL is in normal operation mode (Default).
 * |        |          |1 = PLL is in bypass mode.
 * |[30]    |RESETN    |Reset Mode Enable Bit
 * |        |          |0 = PLL is in reset mode.
 * |        |          |1 = PLL is in normal operation mode (Default).
 * |[31]    |PLL_STB   |PLL Stable Flag
 * |        |          |0 = PLL is not stable.
 * |        |          |1 = PLL is stable (500us after PLL setting changed).
 * @var CLK_T::UPLLCON
 * Offset: 0x64  UPLL Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[6:0]   |FB_DV     |PLL VCO Output Clock Feedback Divider Integer Part
 * |        |          |Set the feedback divider factor (N) from 1 to 128.
 * |        |          |The N = FB_DV[6:0] + 1.
 * |[12:7]  |IN_DV     |Reference Input Divider
 * |        |          |Set the reference divider factor (M) from 1 to 64.
 * |        |          |The M = IN_DV[5:0] + 1.
 * |[15:13] |OUT_DV    |PLL Output Divider
 * |        |          |Set the output divider factor (P) from 1 to 8.
 * |        |          |The P = OUT_DV[2:0] + 1.
 * |[27:16] |FRAC      |PLL VCO Output Clock Feedback Divider Fraction Part
 * |        |          |Set the fraction part (X) of feedback divider factor.
 * |        |          |Write a non-zero value to this field enables the fraction mode automatically
 * |        |          |Please keep this field in 0x0 if donu2019t want to use the PLL fraction mode.
 * |        |          |The X = FRAC[11:0] / 212.
 * |[28]    |PD        |Power-down mode Enable Bit
 * |        |          |0 = PLL is in normal operation mode.
 * |        |          |1 = PLL is in Power-down mode (Default).
 * |[29]    |BYPASS    |Bypass Mode Enable Bit
 * |        |          |0 = PLL is in normal operation mode (Default).
 * |        |          |1 = PLL is in bypass mode.
 * |[30]    |RESETN    |Reset Mode Enable Bit
 * |        |          |0 = PLL is in reset mode.
 * |        |          |1 = PLL is in normal operation mode (Default).
 * |[31]    |PLL_STB   |PLL Stable Flag
 * |        |          |0 = PLL is not stable.
 * |        |          |1 = PLL is stable (500us after PLL setting changed).
 * @var CLK_T::PLLSTBCNTR
 * Offset: 0x80  PLL Stable Counter and Test Clock Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |PLLSTBCNT |PLL Stable Counter
 * |        |          |The PLL stable time is set by PLLSTBCNT[15:0]
 * |        |          |The stable time is determined by the number of PLLSTBCNT[15:0] cycles of the PLL source clock.
 * @var CLK_T::STOPREQ
 * Offset: 0x90  Clock Stop Request Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |CANFD0STR |CANFD0 Clock Stop Request
 * |        |          |This bit is used to stop CANFD0 clock.
 * |        |          |0 = CANFD0 clock is not stopped by this bit. (default)
 * |        |          |1 = Set this bit and check the CANFD0STA(CLK_STOPACK[0]) is 1, then CANFD0 clock stop.
 * |[1]     |CANFD1STR |CANFD1 Clock Stop Request
 * |        |          |This bit is used to stop CANFD1 clock.
 * |        |          |0 = CANFD1 clock is not stopped by this bit. (default)
 * |        |          |1 = Set this bit and check the CANFD1STA(CLK_STOPACK[1]) is 1, then CANFD1 clock stop.
 * |[2]     |CANFD2STR |CANFD2 Clock Stop Request
 * |        |          |This bit is used to stop CANFD2 clock.
 * |        |          |0 = CANFD2 clock is not stopped by this bit. (default)
 * |        |          |1 = Set this bit and check the CANFD2STA(CLK_STOPACK[2]) is 1, then CANFD2 clock stop.
 * |[3]     |CANFD3STR |CANFD3 Clock Stop Request
 * |        |          |This bit is used to stop CANFD3 clock.
 * |        |          |0 = CANFD3 clock is not stopped by this bit. (default)
 * |        |          |1 = Set this bit and check the CANFD3STA(CLK_STOPACK[3]) is 1, then CANFD3 clock stop.
 * @var CLK_T::STOPACK
 * Offset: 0x94  Clock Stop Acknowledge Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |CANFD0STA |CANFD0 Clock Stop Acknowledge (Read Only)
 * |        |          |This bit is used to check CANFD0 clock stop by setting CANFD0STR(CLK_STOPREQ[0]).
 * |        |          |0 = CANFD0 clock not stopped.
 * |        |          |1 = CANFD0 clock stopped.
 * |[1]     |CANFD1STA |CANFD1 Clock Stop Acknowledge (Read Only)
 * |        |          |This bit is used to check CANFD1 clock stop by setting CANFD1STR(CLK_STOPREQ[1]).
 * |        |          |0 = CANFD1 clock not stopped.
 * |        |          |1 = CANFD1 clock stopped.
 * |[2]     |CANFD2STA |CANFD2 Clock Stop Acknowledge (Read Only)
 * |        |          |This bit is used to check CANFD2 clock stop by setting CANFD2STR(CLK_STOPREQ[2]).
 * |        |          |0 = CANFD2 clock not stopped.
 * |        |          |1 = CANFD2 clock stopped.
 * |[3]     |CANFD3STA |CANFD3 Clock Stop Acknowledge (Read Only)
 * |        |          |This bit is used to check CANFD3 clock stop by setting CANFD3STR(CLK_STOPREQ[3]).
 * |        |          |0 = CANFD3 clock not stopped.
 * |        |          |1 = CANFD3 clock stopped.
 */
    __IO uint32_t PMCON;                 /*!< [0x0000] Power Management Control Register                                */
    __I  uint32_t RESERVE0[3];
    __IO uint32_t HCLKEN0;               /*!< [0x0010] AHB Devices Clock Enable Control Register 0                      */
    __IO uint32_t HCLKEN1;               /*!< [0x0014] AHB Devices Clock Enable Control Register 1                      */
    __IO uint32_t PCLKEN0;               /*!< [0x0018] APB Devices Clock Enable Control Register 0                      */
    __IO uint32_t PCLKEN1;               /*!< [0x001c] APB Devices Clock Enable Control Register 1                      */
    __IO uint32_t DIVCTL0;               /*!< [0x0020] Clock Divider Control Register 0                                 */
    __IO uint32_t DIVCTL1;               /*!< [0x0024] Clock Divider Control Register 1                                 */
    __IO uint32_t DIVCTL2;               /*!< [0x0028] Clock Divider Control Register 2                                 */
    __IO uint32_t DIVCTL3;               /*!< [0x002c] Clock Divider Control Register 3                                 */
    __IO uint32_t DIVCTL4;               /*!< [0x0030] Clock Divider Control Register 4                                 */
    __IO uint32_t DIVCTL5;               /*!< [0x0034] Clock Divider Control Register 5                                 */
    __IO uint32_t DIVCTL6;               /*!< [0x0038] Clock Divider Control Register 6                                 */
    __IO uint32_t DIVCTL7;               /*!< [0x003c] Clock Divider Control Register 7                                 */
    __IO uint32_t DIVCTL8;               /*!< [0x0040] Clock Divider Control Register 8                                 */
    __IO uint32_t DIVCTL9;               /*!< [0x0044] Clock Divider Control Register 9                                 */
    __I  uint32_t RESERVE1[6];
    __IO uint32_t APLLCON;               /*!< [0x0060] APLL Control Register                                            */
    __IO uint32_t UPLLCON;               /*!< [0x0064] UPLL Control Register                                            */
    __I  uint32_t RESERVE2[6];
    __IO uint32_t PLLSTBCNTR;            /*!< [0x0080] PLL Stable Counter and Test Clock Control Register               */
    __I  uint32_t RESERVE3[3];
    __IO uint32_t STOPREQ;               /*!< [0x0090] Clock Stop Request Register                                      */
    __I  uint32_t STOPACK;               /*!< [0x0094] Clock Stop Acknowledge Register                                  */

} CLK_T;

/**
    @addtogroup CLK_CONST CLK Bit Field Definition
    Constant Definitions for CLK Controller
@{ */

#define CLK_PMCON_HXT_EN_Pos             (0)                                               /*!< CLK_T::PMCON: HXT_EN Position          */
#define CLK_PMCON_HXT_EN_Msk             (0x1ul << CLK_PMCON_HXT_EN_Pos)                   /*!< CLK_T::PMCON: HXT_EN Mask              */

#define CLK_PMCON_HXT_CTL_Pos            (1)                                               /*!< CLK_T::PMCON: HXT_CTL Position         */
#define CLK_PMCON_HXT_CTL_Msk            (0x1ul << CLK_PMCON_HXT_CTL_Pos)                  /*!< CLK_T::PMCON: HXT_CTL Mask             */

