yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/clk_reg.h
#define CLK_PMCON_PRESCALE_Pos           (8)                                               /*!< CLK_T::PMCON: PRESCALE Position        */
#define CLK_PMCON_PRESCALE_Msk           (0xfffful << CLK_PMCON_PRESCALE_Pos)              /*!< CLK_T::PMCON: PRESCALE Mask            */

#define CLK_HCLKEN0_CPUCKEN_Pos          (0)                                               /*!< CLK_T::HCLKEN0: CPUCKEN Position       */
#define CLK_HCLKEN0_CPUCKEN_Msk          (0x1ul << CLK_HCLKEN0_CPUCKEN_Pos)                /*!< CLK_T::HCLKEN0: CPUCKEN Mask           */

#define CLK_HCLKEN0_HCLKCKEN_Pos         (1)                                               /*!< CLK_T::HCLKEN0: HCLKCKEN Position      */
#define CLK_HCLKEN0_HCLKCKEN_Msk         (0x1ul << CLK_HCLKEN0_HCLKCKEN_Pos)               /*!< CLK_T::HCLKEN0: HCLKCKEN Mask          */

#define CLK_HCLKEN0_HCLK1CKEN_Pos        (2)                                               /*!< CLK_T::HCLKEN0: HCLK1CKEN Position     */
#define CLK_HCLKEN0_HCLK1CKEN_Msk        (0x1ul << CLK_HCLKEN0_HCLK1CKEN_Pos)              /*!< CLK_T::HCLKEN0: HCLK1CKEN Mask         */

#define CLK_HCLKEN0_CLKOCKEN_Pos         (6)                                               /*!< CLK_T::HCLKEN0: CLKOCKEN Position      */
#define CLK_HCLKEN0_CLKOCKEN_Msk         (0x1ul << CLK_HCLKEN0_CLKOCKEN_Pos)               /*!< CLK_T::HCLKEN0: CLKOCKEN Mask          */

#define CLK_HCLKEN0_SRAMCKEN_Pos         (8)                                               /*!< CLK_T::HCLKEN0: SRAMCKEN Position      */
#define CLK_HCLKEN0_SRAMCKEN_Msk         (0x1ul << CLK_HCLKEN0_SRAMCKEN_Pos)               /*!< CLK_T::HCLKEN0: SRAMCKEN Mask          */

#define CLK_HCLKEN0_EBICKEN_Pos          (9)                                               /*!< CLK_T::HCLKEN0: EBICKEN Position       */
#define CLK_HCLKEN0_EBICKEN_Msk          (0x1ul << CLK_HCLKEN0_EBICKEN_Pos)                /*!< CLK_T::HCLKEN0: EBICKEN Mask           */

#define CLK_HCLKEN0_SDICCKEN_Pos         (10)                                              /*!< CLK_T::HCLKEN0: SDICCKEN Position      */
#define CLK_HCLKEN0_SDICCKEN_Msk         (0x1ul << CLK_HCLKEN0_SDICCKEN_Pos)               /*!< CLK_T::HCLKEN0: SDICCKEN Mask          */

#define CLK_HCLKEN0_GPIOCKEN_Pos         (11)                                              /*!< CLK_T::HCLKEN0: GPIOCKEN Position      */
#define CLK_HCLKEN0_GPIOCKEN_Msk         (0x1ul << CLK_HCLKEN0_GPIOCKEN_Pos)               /*!< CLK_T::HCLKEN0: GPIOCKEN Mask          */

#define CLK_HCLKEN0_PCLK0CKEN_Pos        (12)                                              /*!< CLK_T::HCLKEN0: PCLK0CKEN Position     */
#define CLK_HCLKEN0_PCLK0CKEN_Msk        (0x1ul << CLK_HCLKEN0_PCLK0CKEN_Pos)              /*!< CLK_T::HCLKEN0: PCLK0CKEN Mask         */

#define CLK_HCLKEN0_PCLK1CKEN_Pos        (13)                                              /*!< CLK_T::HCLKEN0: PCLK1CKEN Position     */
#define CLK_HCLKEN0_PCLK1CKEN_Msk        (0x1ul << CLK_HCLKEN0_PCLK1CKEN_Pos)              /*!< CLK_T::HCLKEN0: PCLK1CKEN Mask         */

#define CLK_HCLKEN0_PCLK2CKEN_Pos        (14)                                              /*!< CLK_T::HCLKEN0: PCLK2CKEN Position     */
#define CLK_HCLKEN0_PCLK2CKEN_Msk        (0x1ul << CLK_HCLKEN0_PCLK2CKEN_Pos)              /*!< CLK_T::HCLKEN0: PCLK2CKEN Mask         */

#define CLK_HCLKEN0_PCLK3CKEN_Pos        (15)                                              /*!< CLK_T::HCLKEN0: PCLK3CKEN Position     */
#define CLK_HCLKEN0_PCLK3CKEN_Msk        (0x1ul << CLK_HCLKEN0_PCLK3CKEN_Pos)              /*!< CLK_T::HCLKEN0: PCLK3CKEN Mask         */

#define CLK_HCLKEN0_PDMA0EN_Pos          (16)                                              /*!< CLK_T::HCLKEN0: PDMA0EN Position       */
#define CLK_HCLKEN0_PDMA0EN_Msk          (0x1ul << CLK_HCLKEN0_PDMA0EN_Pos)                /*!< CLK_T::HCLKEN0: PDMA0EN Mask           */

#define CLK_HCLKEN0_PDMA1EN_Pos          (17)                                              /*!< CLK_T::HCLKEN0: PDMA1EN Position       */
#define CLK_HCLKEN0_PDMA1EN_Msk          (0x1ul << CLK_HCLKEN0_PDMA1EN_Pos)                /*!< CLK_T::HCLKEN0: PDMA1EN Mask           */

#define CLK_HCLKEN0_EMAC0EN_Pos          (18)                                              /*!< CLK_T::HCLKEN0: EMAC0EN Position       */
#define CLK_HCLKEN0_EMAC0EN_Msk          (0x1ul << CLK_HCLKEN0_EMAC0EN_Pos)                /*!< CLK_T::HCLKEN0: EMAC0EN Mask           */

#define CLK_HCLKEN0_EMAC1EN_Pos          (19)                                              /*!< CLK_T::HCLKEN0: EMAC1EN Position       */
#define CLK_HCLKEN0_EMAC1EN_Msk          (0x1ul << CLK_HCLKEN0_EMAC1EN_Pos)                /*!< CLK_T::HCLKEN0: EMAC1EN Mask           */

#define CLK_HCLKEN0_NANDEN_Pos           (21)                                              /*!< CLK_T::HCLKEN0: NANDEN Position        */
#define CLK_HCLKEN0_NANDEN_Msk           (0x1ul << CLK_HCLKEN0_NANDEN_Pos)                 /*!< CLK_T::HCLKEN0: NANDEN Mask            */

#define CLK_HCLKEN0_SDH0EN_Pos           (22)                                              /*!< CLK_T::HCLKEN0: SDH0EN Position        */
#define CLK_HCLKEN0_SDH0EN_Msk           (0x1ul << CLK_HCLKEN0_SDH0EN_Pos)                 /*!< CLK_T::HCLKEN0: SDH0EN Mask            */

#define CLK_HCLKEN0_SDH1EN_Pos           (23)                                              /*!< CLK_T::HCLKEN0: SDH1EN Position        */
#define CLK_HCLKEN0_SDH1EN_Msk           (0x1ul << CLK_HCLKEN0_SDH1EN_Pos)                 /*!< CLK_T::HCLKEN0: SDH1EN Mask            */

#define CLK_HCLKEN0_USBHEN_Pos           (24)                                              /*!< CLK_T::HCLKEN0: USBHEN Position        */
#define CLK_HCLKEN0_USBHEN_Msk           (0x1ul << CLK_HCLKEN0_USBHEN_Pos)                 /*!< CLK_T::HCLKEN0: USBHEN Mask            */

#define CLK_HCLKEN0_USBDEN_Pos           (25)                                              /*!< CLK_T::HCLKEN0: USBDEN Position        */
#define CLK_HCLKEN0_USBDEN_Msk           (0x1ul << CLK_HCLKEN0_USBDEN_Pos)                 /*!< CLK_T::HCLKEN0: USBDEN Mask            */

