yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/clk_reg.h
#define CLK_HCLKEN1_I2SCKEN_Pos          (0)                                               /*!< CLK_T::HCLKEN1: I2SCKEN Position       */
#define CLK_HCLKEN1_I2SCKEN_Msk          (0x1ul << CLK_HCLKEN1_I2SCKEN_Pos)                /*!< CLK_T::HCLKEN1: I2SCKEN Mask           */

#define CLK_HCLKEN1_CRPTCKEN_Pos         (1)                                               /*!< CLK_T::HCLKEN1: CRPTCKEN Position      */
#define CLK_HCLKEN1_CRPTCKEN_Msk         (0x1ul << CLK_HCLKEN1_CRPTCKEN_Pos)               /*!< CLK_T::HCLKEN1: CRPTCKEN Mask          */

#define CLK_HCLKEN1_KSCKEN_Pos           (2)                                               /*!< CLK_T::HCLKEN1: KSCKEN Position        */
#define CLK_HCLKEN1_KSCKEN_Msk           (0x1ul << CLK_HCLKEN1_KSCKEN_Pos)                 /*!< CLK_T::HCLKEN1: KSCKEN Mask            */

#define CLK_HCLKEN1_OTPIDLE_Pos          (3)                                               /*!< CLK_T::HCLKEN1: OTPIDLE Position       */
#define CLK_HCLKEN1_OTPIDLE_Msk          (0x1ul << CLK_HCLKEN1_OTPIDLE_Pos)                /*!< CLK_T::HCLKEN1: OTPIDLE Mask           */

#define CLK_HCLKEN1_CANF0CKEN_Pos        (8)                                               /*!< CLK_T::HCLKEN1: CANF0CKEN Position     */
#define CLK_HCLKEN1_CANF0CKEN_Msk        (0x1ul << CLK_HCLKEN1_CANF0CKEN_Pos)              /*!< CLK_T::HCLKEN1: CANF0CKEN Mask         */

#define CLK_HCLKEN1_CANF1CKEN_Pos        (9)                                               /*!< CLK_T::HCLKEN1: CANF1CKEN Position     */
#define CLK_HCLKEN1_CANF1CKEN_Msk        (0x1ul << CLK_HCLKEN1_CANF1CKEN_Pos)              /*!< CLK_T::HCLKEN1: CANF1CKEN Mask         */

#define CLK_HCLKEN1_CANF2CKEN_Pos        (10)                                              /*!< CLK_T::HCLKEN1: CANF2CKEN Position     */
#define CLK_HCLKEN1_CANF2CKEN_Msk        (0x1ul << CLK_HCLKEN1_CANF2CKEN_Pos)              /*!< CLK_T::HCLKEN1: CANF2CKEN Mask         */

#define CLK_HCLKEN1_CANF3CKEN_Pos        (11)                                              /*!< CLK_T::HCLKEN1: CANF3CKEN Position     */
#define CLK_HCLKEN1_CANF3CKEN_Msk        (0x1ul << CLK_HCLKEN1_CANF3CKEN_Pos)              /*!< CLK_T::HCLKEN1: CANF3CKEN Mask         */

#define CLK_HCLKEN1_CANRAM0EN_Pos        (16)                                              /*!< CLK_T::HCLKEN1: CANRAM0EN Position     */
#define CLK_HCLKEN1_CANRAM0EN_Msk        (0x1ul << CLK_HCLKEN1_CANRAM0EN_Pos)              /*!< CLK_T::HCLKEN1: CANRAM0EN Mask         */

#define CLK_HCLKEN1_CANRAM1EN_Pos        (17)                                              /*!< CLK_T::HCLKEN1: CANRAM1EN Position     */
#define CLK_HCLKEN1_CANRAM1EN_Msk        (0x1ul << CLK_HCLKEN1_CANRAM1EN_Pos)              /*!< CLK_T::HCLKEN1: CANRAM1EN Mask         */

#define CLK_HCLKEN1_CANRAM2EN_Pos        (18)                                              /*!< CLK_T::HCLKEN1: CANRAM2EN Position     */
#define CLK_HCLKEN1_CANRAM2EN_Msk        (0x1ul << CLK_HCLKEN1_CANRAM2EN_Pos)              /*!< CLK_T::HCLKEN1: CANRAM2EN Mask         */

#define CLK_HCLKEN1_CANRAM3EN_Pos        (19)                                              /*!< CLK_T::HCLKEN1: CANRAM3EN Position     */
#define CLK_HCLKEN1_CANRAM3EN_Msk        (0x1ul << CLK_HCLKEN1_CANRAM3EN_Pos)              /*!< CLK_T::HCLKEN1: CANRAM3EN Mask         */

#define CLK_PCLKEN0_WDTCKEN_Pos          (0)                                               /*!< CLK_T::PCLKEN0: WDTCKEN Position       */
#define CLK_PCLKEN0_WDTCKEN_Msk          (0x1ul << CLK_PCLKEN0_WDTCKEN_Pos)                /*!< CLK_T::PCLKEN0: WDTCKEN Mask           */

#define CLK_PCLKEN0_WWDTCKEN_Pos         (1)                                               /*!< CLK_T::PCLKEN0: WWDTCKEN Position      */
#define CLK_PCLKEN0_WWDTCKEN_Msk         (0x1ul << CLK_PCLKEN0_WWDTCKEN_Pos)               /*!< CLK_T::PCLKEN0: WWDTCKEN Mask          */

#define CLK_PCLKEN0_RTCCKEN_Pos          (2)                                               /*!< CLK_T::PCLKEN0: RTCCKEN Position       */
#define CLK_PCLKEN0_RTCCKEN_Msk          (0x1ul << CLK_PCLKEN0_RTCCKEN_Pos)                /*!< CLK_T::PCLKEN0: RTCCKEN Mask           */

#define CLK_PCLKEN0_AICCKEN_Pos          (3)                                               /*!< CLK_T::PCLKEN0: AICCKEN Position       */
#define CLK_PCLKEN0_AICCKEN_Msk          (0x1ul << CLK_PCLKEN0_AICCKEN_Pos)                /*!< CLK_T::PCLKEN0: AICCKEN Mask           */

#define CLK_PCLKEN0_TMR0CKEN_Pos         (8)                                               /*!< CLK_T::PCLKEN0: TMR0CKEN Position      */
#define CLK_PCLKEN0_TMR0CKEN_Msk         (0x1ul << CLK_PCLKEN0_TMR0CKEN_Pos)               /*!< CLK_T::PCLKEN0: TMR0CKEN Mask          */

#define CLK_PCLKEN0_TMR1CKEN_Pos         (9)                                               /*!< CLK_T::PCLKEN0: TMR1CKEN Position      */
#define CLK_PCLKEN0_TMR1CKEN_Msk         (0x1ul << CLK_PCLKEN0_TMR1CKEN_Pos)               /*!< CLK_T::PCLKEN0: TMR1CKEN Mask          */

#define CLK_PCLKEN0_TMR2CKEN_Pos         (10)                                              /*!< CLK_T::PCLKEN0: TMR2CKEN Position      */
#define CLK_PCLKEN0_TMR2CKEN_Msk         (0x1ul << CLK_PCLKEN0_TMR2CKEN_Pos)               /*!< CLK_T::PCLKEN0: TMR2CKEN Mask          */

#define CLK_PCLKEN0_TMR3CKEN_Pos         (11)                                              /*!< CLK_T::PCLKEN0: TMR3CKEN Position      */
#define CLK_PCLKEN0_TMR3CKEN_Msk         (0x1ul << CLK_PCLKEN0_TMR3CKEN_Pos)               /*!< CLK_T::PCLKEN0: TMR3CKEN Mask          */

#define CLK_PCLKEN0_TMR4CKEN_Pos         (12)                                              /*!< CLK_T::PCLKEN0: TMR4CKEN Position      */
#define CLK_PCLKEN0_TMR4CKEN_Msk         (0x1ul << CLK_PCLKEN0_TMR4CKEN_Pos)               /*!< CLK_T::PCLKEN0: TMR4CKEN Mask          */

#define CLK_PCLKEN0_TMR5CKEN_Pos         (13)                                              /*!< CLK_T::PCLKEN0: TMR5CKEN Position      */
#define CLK_PCLKEN0_TMR5CKEN_Msk         (0x1ul << CLK_PCLKEN0_TMR5CKEN_Pos)               /*!< CLK_T::PCLKEN0: TMR5CKEN Mask          */

