yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/clk_reg.h
#define CLK_PCLKEN0_UART0CKEN_Pos        (16)                                              /*!< CLK_T::PCLKEN0: UART0CKEN Position     */
#define CLK_PCLKEN0_UART0CKEN_Msk        (0x1ul << CLK_PCLKEN0_UART0CKEN_Pos)              /*!< CLK_T::PCLKEN0: UART0CKEN Mask         */

#define CLK_PCLKEN0_UART1CKEN_Pos        (17)                                              /*!< CLK_T::PCLKEN0: UART1CKEN Position     */
#define CLK_PCLKEN0_UART1CKEN_Msk        (0x1ul << CLK_PCLKEN0_UART1CKEN_Pos)              /*!< CLK_T::PCLKEN0: UART1CKEN Mask         */

#define CLK_PCLKEN0_UART2CKEN_Pos        (18)                                              /*!< CLK_T::PCLKEN0: UART2CKEN Position     */
#define CLK_PCLKEN0_UART2CKEN_Msk        (0x1ul << CLK_PCLKEN0_UART2CKEN_Pos)              /*!< CLK_T::PCLKEN0: UART2CKEN Mask         */

#define CLK_PCLKEN0_UART3CKEN_Pos        (19)                                              /*!< CLK_T::PCLKEN0: UART3CKEN Position     */
#define CLK_PCLKEN0_UART3CKEN_Msk        (0x1ul << CLK_PCLKEN0_UART3CKEN_Pos)              /*!< CLK_T::PCLKEN0: UART3CKEN Mask         */

#define CLK_PCLKEN0_UART4CKEN_Pos        (20)                                              /*!< CLK_T::PCLKEN0: UART4CKEN Position     */
#define CLK_PCLKEN0_UART4CKEN_Msk        (0x1ul << CLK_PCLKEN0_UART4CKEN_Pos)              /*!< CLK_T::PCLKEN0: UART4CKEN Mask         */

#define CLK_PCLKEN0_UART5CKEN_Pos        (21)                                              /*!< CLK_T::PCLKEN0: UART5CKEN Position     */
#define CLK_PCLKEN0_UART5CKEN_Msk        (0x1ul << CLK_PCLKEN0_UART5CKEN_Pos)              /*!< CLK_T::PCLKEN0: UART5CKEN Mask         */

#define CLK_PCLKEN0_UART6CKEN_Pos        (22)                                              /*!< CLK_T::PCLKEN0: UART6CKEN Position     */
#define CLK_PCLKEN0_UART6CKEN_Msk        (0x1ul << CLK_PCLKEN0_UART6CKEN_Pos)              /*!< CLK_T::PCLKEN0: UART6CKEN Mask         */

#define CLK_PCLKEN0_UART7CKEN_Pos        (23)                                              /*!< CLK_T::PCLKEN0: UART7CKEN Position     */
#define CLK_PCLKEN0_UART7CKEN_Msk        (0x1ul << CLK_PCLKEN0_UART7CKEN_Pos)              /*!< CLK_T::PCLKEN0: UART7CKEN Mask         */

#define CLK_PCLKEN0_UART8CKEN_Pos        (24)                                              /*!< CLK_T::PCLKEN0: UART8CKEN Position     */
#define CLK_PCLKEN0_UART8CKEN_Msk        (0x1ul << CLK_PCLKEN0_UART8CKEN_Pos)              /*!< CLK_T::PCLKEN0: UART8CKEN Mask         */

#define CLK_PCLKEN0_UART9CKEN_Pos        (25)                                              /*!< CLK_T::PCLKEN0: UART9CKEN Position     */
#define CLK_PCLKEN0_UART9CKEN_Msk        (0x1ul << CLK_PCLKEN0_UART9CKEN_Pos)              /*!< CLK_T::PCLKEN0: UART9CKEN Mask         */

#define CLK_PCLKEN1_I2C0CKEN_Pos         (0)                                               /*!< CLK_T::PCLKEN1: I2C0CKEN Position      */
#define CLK_PCLKEN1_I2C0CKEN_Msk         (0x1ul << CLK_PCLKEN1_I2C0CKEN_Pos)               /*!< CLK_T::PCLKEN1: I2C0CKEN Mask          */

#define CLK_PCLKEN1_I2C1CKEN_Pos         (1)                                               /*!< CLK_T::PCLKEN1: I2C1CKEN Position      */
#define CLK_PCLKEN1_I2C1CKEN_Msk         (0x1ul << CLK_PCLKEN1_I2C1CKEN_Pos)               /*!< CLK_T::PCLKEN1: I2C1CKEN Mask          */

#define CLK_PCLKEN1_I2C2CKEN_Pos         (2)                                               /*!< CLK_T::PCLKEN1: I2C2CKEN Position      */
#define CLK_PCLKEN1_I2C2CKEN_Msk         (0x1ul << CLK_PCLKEN1_I2C2CKEN_Pos)               /*!< CLK_T::PCLKEN1: I2C2CKEN Mask          */

#define CLK_PCLKEN1_I2C3CKEN_Pos         (3)                                               /*!< CLK_T::PCLKEN1: I2C3CKEN Position      */
#define CLK_PCLKEN1_I2C3CKEN_Msk         (0x1ul << CLK_PCLKEN1_I2C3CKEN_Pos)               /*!< CLK_T::PCLKEN1: I2C3CKEN Mask          */

#define CLK_PCLKEN1_SPI0CKEN_Pos         (4)                                               /*!< CLK_T::PCLKEN1: SPI0CKEN Position      */
#define CLK_PCLKEN1_SPI0CKEN_Msk         (0x1ul << CLK_PCLKEN1_SPI0CKEN_Pos)               /*!< CLK_T::PCLKEN1: SPI0CKEN Mask          */

#define CLK_PCLKEN1_SPI1CKEN_Pos         (5)                                               /*!< CLK_T::PCLKEN1: SPI1CKEN Position      */
#define CLK_PCLKEN1_SPI1CKEN_Msk         (0x1ul << CLK_PCLKEN1_SPI1CKEN_Pos)               /*!< CLK_T::PCLKEN1: SPI1CKEN Mask          */

#define CLK_PCLKEN1_SPI2CKEN_Pos         (6)                                               /*!< CLK_T::PCLKEN1: SPI2CKEN Position      */
#define CLK_PCLKEN1_SPI2CKEN_Msk         (0x1ul << CLK_PCLKEN1_SPI2CKEN_Pos)               /*!< CLK_T::PCLKEN1: SPI2CKEN Mask          */

#define CLK_PCLKEN1_SPI3CKEN_Pos         (7)                                               /*!< CLK_T::PCLKEN1: SPI3CKEN Position      */
#define CLK_PCLKEN1_SPI3CKEN_Msk         (0x1ul << CLK_PCLKEN1_SPI3CKEN_Pos)               /*!< CLK_T::PCLKEN1: SPI3CKEN Mask          */

#define CLK_PCLKEN1_CAN0CKEN_Pos         (8)                                               /*!< CLK_T::PCLKEN1: CAN0CKEN Position      */
#define CLK_PCLKEN1_CAN0CKEN_Msk         (0x1ul << CLK_PCLKEN1_CAN0CKEN_Pos)               /*!< CLK_T::PCLKEN1: CAN0CKEN Mask          */

#define CLK_PCLKEN1_CAN1CKEN_Pos         (9)                                               /*!< CLK_T::PCLKEN1: CAN1CKEN Position      */
#define CLK_PCLKEN1_CAN1CKEN_Msk         (0x1ul << CLK_PCLKEN1_CAN1CKEN_Pos)               /*!< CLK_T::PCLKEN1: CAN1CKEN Mask          */

#define CLK_PCLKEN1_CAN2CKEN_Pos         (10)                                              /*!< CLK_T::PCLKEN1: CAN2CKEN Position      */
#define CLK_PCLKEN1_CAN2CKEN_Msk         (0x1ul << CLK_PCLKEN1_CAN2CKEN_Pos)               /*!< CLK_T::PCLKEN1: CAN2CKEN Mask          */

#define CLK_PCLKEN1_CAN3CKEN_Pos         (11)                                              /*!< CLK_T::PCLKEN1: CAN3CKEN Position      */
#define CLK_PCLKEN1_CAN3CKEN_Msk         (0x1ul << CLK_PCLKEN1_CAN3CKEN_Pos)               /*!< CLK_T::PCLKEN1: CAN3CKEN Mask          */

#define CLK_PCLKEN1_SMC0CKEN_Pos         (16)                                              /*!< CLK_T::PCLKEN1: SMC0CKEN Position      */
#define CLK_PCLKEN1_SMC0CKEN_Msk         (0x1ul << CLK_PCLKEN1_SMC0CKEN_Pos)               /*!< CLK_T::PCLKEN1: SMC0CKEN Mask          */

#define CLK_PCLKEN1_SMC1CKEN_Pos         (17)                                              /*!< CLK_T::PCLKEN1: SMC1CKEN Position      */
#define CLK_PCLKEN1_SMC1CKEN_Msk         (0x1ul << CLK_PCLKEN1_SMC1CKEN_Pos)               /*!< CLK_T::PCLKEN1: SMC1CKEN Mask          */

#define CLK_PCLKEN1_QSPI0CKEN_Pos        (20)                                              /*!< CLK_T::PCLKEN1: QSPI0CKEN Position     */
#define CLK_PCLKEN1_QSPI0CKEN_Msk        (0x1ul << CLK_PCLKEN1_QSPI0CKEN_Pos)              /*!< CLK_T::PCLKEN1: QSPI0CKEN Mask         */

#define CLK_PCLKEN1_ADCCKEN_Pos          (24)                                              /*!< CLK_T::PCLKEN1: ADCCKEN Position       */
#define CLK_PCLKEN1_ADCCKEN_Msk          (0x1ul << CLK_PCLKEN1_ADCCKEN_Pos)                /*!< CLK_T::PCLKEN1: ADCCKEN Mask           */

#define CLK_PCLKEN1_EADCCKEN_Pos         (25)                                              /*!< CLK_T::PCLKEN1: EADCCKEN Position      */
#define CLK_PCLKEN1_EADCCKEN_Msk         (0x1ul << CLK_PCLKEN1_EADCCKEN_Pos)               /*!< CLK_T::PCLKEN1: EADCCKEN Mask          */

#define CLK_PCLKEN1_BPWM0CKEN_Pos        (26)                                              /*!< CLK_T::PCLKEN1: BPWM0CKEN Position     */
#define CLK_PCLKEN1_BPWM0CKEN_Msk        (0x1ul << CLK_PCLKEN1_BPWM0CKEN_Pos)              /*!< CLK_T::PCLKEN1: BPWM0CKEN Mask         */

#define CLK_PCLKEN1_BPWM1CKEN_Pos        (27)                                              /*!< CLK_T::PCLKEN1: BPWM1CKEN Position     */
#define CLK_PCLKEN1_BPWM1CKEN_Msk        (0x1ul << CLK_PCLKEN1_BPWM1CKEN_Pos)              /*!< CLK_T::PCLKEN1: BPWM1CKEN Mask         */

#define CLK_DIVCTL0_SYSTEM_S_Pos         (3)                                               /*!< CLK_T::DIVCTL0: SYSTEM_S Position      */
#define CLK_DIVCTL0_SYSTEM_S_Msk         (0x3ul << CLK_DIVCTL0_SYSTEM_S_Pos)               /*!< CLK_T::DIVCTL0: SYSTEM_S Mask          */

#define CLK_DIVCTL0_CPUDIV2EN_Pos        (8)                                               /*!< CLK_T::DIVCTL0: CPUDIV2EN Position     */
#define CLK_DIVCTL0_CPUDIV2EN_Msk        (0x1ul << CLK_DIVCTL0_CPUDIV2EN_Pos)              /*!< CLK_T::DIVCTL0: CPUDIV2EN Mask         */

#define CLK_DIVCTL0_PCLK3DIV_Pos         (16)                                              /*!< CLK_T::DIVCTL0: PCLK3DIV Position      */
#define CLK_DIVCTL0_PCLK3DIV_Msk         (0x7ul << CLK_DIVCTL0_PCLK3DIV_Pos)               /*!< CLK_T::DIVCTL0: PCLK3DIV Mask          */

#define CLK_DIVCTL0_PCLK3_S_Pos          (19)                                              /*!< CLK_T::DIVCTL0: PCLK3_S Position       */
#define CLK_DIVCTL0_PCLK3_S_Msk          (0x3ul << CLK_DIVCTL0_PCLK3_S_Pos)                /*!< CLK_T::DIVCTL0: PCLK3_S Mask           */

