yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/clk_reg.h
#define CLK_DIVCTL1_I2S_S_Pos            (19)                                              /*!< CLK_T::DIVCTL1: I2S_S Position         */
#define CLK_DIVCTL1_I2S_S_Msk            (0x3ul << CLK_DIVCTL1_I2S_S_Pos)                  /*!< CLK_T::DIVCTL1: I2S_S Mask             */

#define CLK_DIVCTL1_I2S_N_Pos            (24)                                              /*!< CLK_T::DIVCTL1: I2S_N Position         */
#define CLK_DIVCTL1_I2S_N_Msk            (0xfful << CLK_DIVCTL1_I2S_N_Pos)                 /*!< CLK_T::DIVCTL1: I2S_N Mask             */

#define CLK_DIVCTL2_CANFD0_S_Pos         (0)                                               /*!< CLK_T::DIVCTL2: CANFD0_S Position      */
#define CLK_DIVCTL2_CANFD0_S_Msk         (0x1ul << CLK_DIVCTL2_CANFD0_S_Pos)               /*!< CLK_T::DIVCTL2: CANFD0_S Mask          */

#define CLK_DIVCTL2_CANFD1_S_Pos         (1)                                               /*!< CLK_T::DIVCTL2: CANFD1_S Position      */
#define CLK_DIVCTL2_CANFD1_S_Msk         (0x1ul << CLK_DIVCTL2_CANFD1_S_Pos)               /*!< CLK_T::DIVCTL2: CANFD1_S Mask          */

#define CLK_DIVCTL2_CANFD2_S_Pos         (2)                                               /*!< CLK_T::DIVCTL2: CANFD2_S Position      */
#define CLK_DIVCTL2_CANFD2_S_Msk         (0x1ul << CLK_DIVCTL2_CANFD2_S_Pos)               /*!< CLK_T::DIVCTL2: CANFD2_S Mask          */

#define CLK_DIVCTL2_CANFD3_S_Pos         (3)                                               /*!< CLK_T::DIVCTL2: CANFD3_S Position      */
#define CLK_DIVCTL2_CANFD3_S_Msk         (0x1ul << CLK_DIVCTL2_CANFD3_S_Pos)               /*!< CLK_T::DIVCTL2: CANFD3_S Mask          */

#define CLK_DIVCTL2_QSPI0_S_Pos          (8)                                               /*!< CLK_T::DIVCTL2: QSPI0_S Position       */
#define CLK_DIVCTL2_QSPI0_S_Msk          (0x3ul << CLK_DIVCTL2_QSPI0_S_Pos)                /*!< CLK_T::DIVCTL2: QSPI0_S Mask           */

#define CLK_DIVCTL2_SPI0_S_Pos           (10)                                              /*!< CLK_T::DIVCTL2: SPI0_S Position        */
#define CLK_DIVCTL2_SPI0_S_Msk           (0x3ul << CLK_DIVCTL2_SPI0_S_Pos)                 /*!< CLK_T::DIVCTL2: SPI0_S Mask            */

#define CLK_DIVCTL2_SPI1_S_Pos           (12)                                              /*!< CLK_T::DIVCTL2: SPI1_S Position        */
#define CLK_DIVCTL2_SPI1_S_Msk           (0x3ul << CLK_DIVCTL2_SPI1_S_Pos)                 /*!< CLK_T::DIVCTL2: SPI1_S Mask            */

#define CLK_DIVCTL2_SPI2_S_Pos           (14)                                              /*!< CLK_T::DIVCTL2: SPI2_S Position        */
#define CLK_DIVCTL2_SPI2_S_Msk           (0x3ul << CLK_DIVCTL2_SPI2_S_Pos)                 /*!< CLK_T::DIVCTL2: SPI2_S Mask            */

#define CLK_DIVCTL2_SPI3_S_Pos           (16)                                              /*!< CLK_T::DIVCTL2: SPI3_S Position        */
#define CLK_DIVCTL2_SPI3_S_Msk           (0x3ul << CLK_DIVCTL2_SPI3_S_Pos)                 /*!< CLK_T::DIVCTL2: SPI3_S Mask            */

#define CLK_DIVCTL3_SD0_S_Pos            (3)                                               /*!< CLK_T::DIVCTL3: SD0_S Position         */
#define CLK_DIVCTL3_SD0_S_Msk            (0x3ul << CLK_DIVCTL3_SD0_S_Pos)                  /*!< CLK_T::DIVCTL3: SD0_S Mask             */

#define CLK_DIVCTL3_SD0_N_Pos            (5)                                               /*!< CLK_T::DIVCTL3: SD0_N Position         */
#define CLK_DIVCTL3_SD0_N_Msk            (0x7fful << CLK_DIVCTL3_SD0_N_Pos)                /*!< CLK_T::DIVCTL3: SD0_N Mask             */

#define CLK_DIVCTL3_SD1_S_Pos            (19)                                              /*!< CLK_T::DIVCTL3: SD1_S Position         */
#define CLK_DIVCTL3_SD1_S_Msk            (0x3ul << CLK_DIVCTL3_SD1_S_Pos)                  /*!< CLK_T::DIVCTL3: SD1_S Mask             */

#define CLK_DIVCTL3_SD1_N_Pos            (21)                                              /*!< CLK_T::DIVCTL3: SD1_N Position         */
#define CLK_DIVCTL3_SD1_N_Msk            (0x7fful << CLK_DIVCTL3_SD1_N_Pos)                /*!< CLK_T::DIVCTL3: SD1_N Mask             */

#define CLK_DIVCTL4_UART0_S_Pos          (3)                                               /*!< CLK_T::DIVCTL4: UART0_S Position       */
#define CLK_DIVCTL4_UART0_S_Msk          (0x3ul << CLK_DIVCTL4_UART0_S_Pos)                /*!< CLK_T::DIVCTL4: UART0_S Mask           */

#define CLK_DIVCTL4_UART0_N_Pos          (5)                                               /*!< CLK_T::DIVCTL4: UART0_N Position       */
#define CLK_DIVCTL4_UART0_N_Msk          (0x7ul << CLK_DIVCTL4_UART0_N_Pos)                /*!< CLK_T::DIVCTL4: UART0_N Mask           */

#define CLK_DIVCTL4_UART1_S_Pos          (11)                                              /*!< CLK_T::DIVCTL4: UART1_S Position       */
#define CLK_DIVCTL4_UART1_S_Msk          (0x3ul << CLK_DIVCTL4_UART1_S_Pos)                /*!< CLK_T::DIVCTL4: UART1_S Mask           */

#define CLK_DIVCTL4_UART1_N_Pos          (13)                                              /*!< CLK_T::DIVCTL4: UART1_N Position       */
#define CLK_DIVCTL4_UART1_N_Msk          (0x7ul << CLK_DIVCTL4_UART1_N_Pos)                /*!< CLK_T::DIVCTL4: UART1_N Mask           */

#define CLK_DIVCTL4_UART2_S_Pos          (19)                                              /*!< CLK_T::DIVCTL4: UART2_S Position       */
#define CLK_DIVCTL4_UART2_S_Msk          (0x3ul << CLK_DIVCTL4_UART2_S_Pos)                /*!< CLK_T::DIVCTL4: UART2_S Mask           */

#define CLK_DIVCTL4_UART2_N_Pos          (21)                                              /*!< CLK_T::DIVCTL4: UART2_N Position       */
#define CLK_DIVCTL4_UART2_N_Msk          (0x7ul << CLK_DIVCTL4_UART2_N_Pos)                /*!< CLK_T::DIVCTL4: UART2_N Mask           */

#define CLK_DIVCTL4_UART3_S_Pos          (27)                                              /*!< CLK_T::DIVCTL4: UART3_S Position       */
#define CLK_DIVCTL4_UART3_S_Msk          (0x3ul << CLK_DIVCTL4_UART3_S_Pos)                /*!< CLK_T::DIVCTL4: UART3_S Mask           */

