yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/clk_reg.h
#define CLK_DIVCTL4_UART3_N_Pos          (29)                                              /*!< CLK_T::DIVCTL4: UART3_N Position       */
#define CLK_DIVCTL4_UART3_N_Msk          (0x7ul << CLK_DIVCTL4_UART3_N_Pos)                /*!< CLK_T::DIVCTL4: UART3_N Mask           */

#define CLK_DIVCTL5_UART4_S_Pos          (3)                                               /*!< CLK_T::DIVCTL5: UART4_S Position       */
#define CLK_DIVCTL5_UART4_S_Msk          (0x3ul << CLK_DIVCTL5_UART4_S_Pos)                /*!< CLK_T::DIVCTL5: UART4_S Mask           */

#define CLK_DIVCTL5_UART4_N_Pos          (5)                                               /*!< CLK_T::DIVCTL5: UART4_N Position       */
#define CLK_DIVCTL5_UART4_N_Msk          (0x7ul << CLK_DIVCTL5_UART4_N_Pos)                /*!< CLK_T::DIVCTL5: UART4_N Mask           */

#define CLK_DIVCTL5_UART5_S_Pos          (11)                                              /*!< CLK_T::DIVCTL5: UART5_S Position       */
#define CLK_DIVCTL5_UART5_S_Msk          (0x3ul << CLK_DIVCTL5_UART5_S_Pos)                /*!< CLK_T::DIVCTL5: UART5_S Mask           */

#define CLK_DIVCTL5_UART5_N_Pos          (13)                                              /*!< CLK_T::DIVCTL5: UART5_N Position       */
#define CLK_DIVCTL5_UART5_N_Msk          (0x7ul << CLK_DIVCTL5_UART5_N_Pos)                /*!< CLK_T::DIVCTL5: UART5_N Mask           */

#define CLK_DIVCTL5_UART6_S_Pos          (19)                                              /*!< CLK_T::DIVCTL5: UART6_S Position       */
#define CLK_DIVCTL5_UART6_S_Msk          (0x3ul << CLK_DIVCTL5_UART6_S_Pos)                /*!< CLK_T::DIVCTL5: UART6_S Mask           */

#define CLK_DIVCTL5_UART6_N_Pos          (21)                                              /*!< CLK_T::DIVCTL5: UART6_N Position       */
#define CLK_DIVCTL5_UART6_N_Msk          (0x7ul << CLK_DIVCTL5_UART6_N_Pos)                /*!< CLK_T::DIVCTL5: UART6_N Mask           */

#define CLK_DIVCTL5_UART7_S_Pos          (27)                                              /*!< CLK_T::DIVCTL5: UART7_S Position       */
#define CLK_DIVCTL5_UART7_S_Msk          (0x3ul << CLK_DIVCTL5_UART7_S_Pos)                /*!< CLK_T::DIVCTL5: UART7_S Mask           */

#define CLK_DIVCTL5_UART7_N_Pos          (29)                                              /*!< CLK_T::DIVCTL5: UART7_N Position       */
#define CLK_DIVCTL5_UART7_N_Msk          (0x7ul << CLK_DIVCTL5_UART7_N_Pos)                /*!< CLK_T::DIVCTL5: UART7_N Mask           */

#define CLK_DIVCTL6_UART8_S_Pos          (3)                                               /*!< CLK_T::DIVCTL6: UART8_S Position       */
#define CLK_DIVCTL6_UART8_S_Msk          (0x3ul << CLK_DIVCTL6_UART8_S_Pos)                /*!< CLK_T::DIVCTL6: UART8_S Mask           */

#define CLK_DIVCTL6_UART8_N_Pos          (5)                                               /*!< CLK_T::DIVCTL6: UART8_N Position       */
#define CLK_DIVCTL6_UART8_N_Msk          (0x7ul << CLK_DIVCTL6_UART8_N_Pos)                /*!< CLK_T::DIVCTL6: UART8_N Mask           */

#define CLK_DIVCTL6_UART9_S_Pos          (11)                                              /*!< CLK_T::DIVCTL6: UART9_S Position       */
#define CLK_DIVCTL6_UART9_S_Msk          (0x3ul << CLK_DIVCTL6_UART9_S_Pos)                /*!< CLK_T::DIVCTL6: UART9_S Mask           */

#define CLK_DIVCTL6_UART9_N_Pos          (13)                                              /*!< CLK_T::DIVCTL6: UART9_N Position       */
#define CLK_DIVCTL6_UART9_N_Msk          (0x7ul << CLK_DIVCTL6_UART9_N_Pos)                /*!< CLK_T::DIVCTL6: UART9_N Mask           */

#define CLK_DIVCTL6_EADC_N_Pos           (16)                                              /*!< CLK_T::DIVCTL6: EADC_N Position        */
#define CLK_DIVCTL6_EADC_N_Msk           (0xfful << CLK_DIVCTL6_EADC_N_Pos)                /*!< CLK_T::DIVCTL6: EADC_N Mask            */

#define CLK_DIVCTL6_SMC0_N_Pos           (24)                                              /*!< CLK_T::DIVCTL6: SMC0_N Position        */
#define CLK_DIVCTL6_SMC0_N_Msk           (0xful << CLK_DIVCTL6_SMC0_N_Pos)                 /*!< CLK_T::DIVCTL6: SMC0_N Mask            */

#define CLK_DIVCTL6_SMC1_N_Pos           (28)                                              /*!< CLK_T::DIVCTL6: SMC1_N Position        */
#define CLK_DIVCTL6_SMC1_N_Msk           (0xful << CLK_DIVCTL6_SMC1_N_Pos)                 /*!< CLK_T::DIVCTL6: SMC1_N Mask            */

#define CLK_DIVCTL7_CANFD0_N_Pos         (0)                                               /*!< CLK_T::DIVCTL7: CANFD0_N Position      */
#define CLK_DIVCTL7_CANFD0_N_Msk         (0xful << CLK_DIVCTL7_CANFD0_N_Pos)               /*!< CLK_T::DIVCTL7: CANFD0_N Mask          */

#define CLK_DIVCTL7_CANFD1_N_Pos         (4)                                               /*!< CLK_T::DIVCTL7: CANFD1_N Position      */
#define CLK_DIVCTL7_CANFD1_N_Msk         (0xful << CLK_DIVCTL7_CANFD1_N_Pos)               /*!< CLK_T::DIVCTL7: CANFD1_N Mask          */

#define CLK_DIVCTL7_CANFD2_N_Pos         (8)                                               /*!< CLK_T::DIVCTL7: CANFD2_N Position      */
#define CLK_DIVCTL7_CANFD2_N_Msk         (0xful << CLK_DIVCTL7_CANFD2_N_Pos)               /*!< CLK_T::DIVCTL7: CANFD2_N Mask          */

#define CLK_DIVCTL7_CANFD3_N_Pos         (12)                                              /*!< CLK_T::DIVCTL7: CANFD3_N Position      */
#define CLK_DIVCTL7_CANFD3_N_Msk         (0xful << CLK_DIVCTL7_CANFD3_N_Pos)               /*!< CLK_T::DIVCTL7: CANFD3_N Mask          */

#define CLK_DIVCTL7_ADC_S_Pos            (20)                                              /*!< CLK_T::DIVCTL7: ADC_S Position         */
#define CLK_DIVCTL7_ADC_S_Msk            (0x3ul << CLK_DIVCTL7_ADC_S_Pos)                  /*!< CLK_T::DIVCTL7: ADC_S Mask             */

#define CLK_DIVCTL7_ADC_N_Pos            (24)                                              /*!< CLK_T::DIVCTL7: ADC_N Position         */
#define CLK_DIVCTL7_ADC_N_Msk            (0xfful << CLK_DIVCTL7_ADC_N_Pos)                 /*!< CLK_T::DIVCTL7: ADC_N Mask             */

#define CLK_DIVCTL8_MDCLKDIV_Pos         (0)                                               /*!< CLK_T::DIVCTL8: MDCLKDIV Position      */
#define CLK_DIVCTL8_MDCLKDIV_Msk         (0xfful << CLK_DIVCTL8_MDCLKDIV_Pos)              /*!< CLK_T::DIVCTL8: MDCLKDIV Mask          */

#define CLK_DIVCTL8_WDTSEL_Pos           (8)                                               /*!< CLK_T::DIVCTL8: WDTSEL Position        */
#define CLK_DIVCTL8_WDTSEL_Msk           (0x3ul << CLK_DIVCTL8_WDTSEL_Pos)                 /*!< CLK_T::DIVCTL8: WDTSEL Mask            */

#define CLK_DIVCTL8_WWDTSEL_Pos          (10)                                              /*!< CLK_T::DIVCTL8: WWDTSEL Position       */
#define CLK_DIVCTL8_WWDTSEL_Msk          (0x3ul << CLK_DIVCTL8_WWDTSEL_Pos)                /*!< CLK_T::DIVCTL8: WWDTSEL Mask           */

#define CLK_DIVCTL8_TMR0SEL_Pos          (16)                                              /*!< CLK_T::DIVCTL8: TMR0SEL Position       */
#define CLK_DIVCTL8_TMR0SEL_Msk          (0x3ul << CLK_DIVCTL8_TMR0SEL_Pos)                /*!< CLK_T::DIVCTL8: TMR0SEL Mask           */

#define CLK_DIVCTL8_TMR1SEL_Pos          (18)                                              /*!< CLK_T::DIVCTL8: TMR1SEL Position       */
#define CLK_DIVCTL8_TMR1SEL_Msk          (0x3ul << CLK_DIVCTL8_TMR1SEL_Pos)                /*!< CLK_T::DIVCTL8: TMR1SEL Mask           */

