yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/clk_reg.h
#define CLK_DIVCTL8_TMR2SEL_Pos          (20)                                              /*!< CLK_T::DIVCTL8: TMR2SEL Position       */
#define CLK_DIVCTL8_TMR2SEL_Msk          (0x3ul << CLK_DIVCTL8_TMR2SEL_Pos)                /*!< CLK_T::DIVCTL8: TMR2SEL Mask           */

#define CLK_DIVCTL8_TMR3SEL_Pos          (22)                                              /*!< CLK_T::DIVCTL8: TMR3SEL Position       */
#define CLK_DIVCTL8_TMR3SEL_Msk          (0x3ul << CLK_DIVCTL8_TMR3SEL_Pos)                /*!< CLK_T::DIVCTL8: TMR3SEL Mask           */

#define CLK_DIVCTL8_TMR4SEL_Pos          (24)                                              /*!< CLK_T::DIVCTL8: TMR4SEL Position       */
#define CLK_DIVCTL8_TMR4SEL_Msk          (0x3ul << CLK_DIVCTL8_TMR4SEL_Pos)                /*!< CLK_T::DIVCTL8: TMR4SEL Mask           */

#define CLK_DIVCTL8_TMR5SEL_Pos          (26)                                              /*!< CLK_T::DIVCTL8: TMR5SEL Position       */
#define CLK_DIVCTL8_TMR5SEL_Msk          (0x3ul << CLK_DIVCTL8_TMR5SEL_Pos)                /*!< CLK_T::DIVCTL8: TMR5SEL Mask           */

#define CLK_DIVCTL9_CKO_S_Pos            (19)                                              /*!< CLK_T::DIVCTL9: CKO_S Position         */
#define CLK_DIVCTL9_CKO_S_Msk            (0x3ul << CLK_DIVCTL9_CKO_S_Pos)                  /*!< CLK_T::DIVCTL9: CKO_S Mask             */

#define CLK_DIVCTL9_CKO_N_Pos            (24)                                              /*!< CLK_T::DIVCTL9: CKO_N Position         */
#define CLK_DIVCTL9_CKO_N_Msk            (0xfful << CLK_DIVCTL9_CKO_N_Pos)                 /*!< CLK_T::DIVCTL9: CKO_N Mask             */

#define CLK_APLLCON_FB_DV_Pos            (0)                                               /*!< CLK_T::APLLCON: FB_DV Position         */
#define CLK_APLLCON_FB_DV_Msk            (0x7ful << CLK_APLLCON_FB_DV_Pos)                 /*!< CLK_T::APLLCON: FB_DV Mask             */

#define CLK_APLLCON_IN_DV_Pos            (7)                                               /*!< CLK_T::APLLCON: IN_DV Position         */
#define CLK_APLLCON_IN_DV_Msk            (0x3ful << CLK_APLLCON_IN_DV_Pos)                 /*!< CLK_T::APLLCON: IN_DV Mask             */

#define CLK_APLLCON_OUT_DV_Pos           (13)                                              /*!< CLK_T::APLLCON: OUT_DV Position        */
#define CLK_APLLCON_OUT_DV_Msk           (0x7ul << CLK_APLLCON_OUT_DV_Pos)                 /*!< CLK_T::APLLCON: OUT_DV Mask            */

#define CLK_APLLCON_FRAC_Pos             (16)                                              /*!< CLK_T::APLLCON: FRAC Position          */
#define CLK_APLLCON_FRAC_Msk             (0xffful << CLK_APLLCON_FRAC_Pos)                 /*!< CLK_T::APLLCON: FRAC Mask              */

#define CLK_APLLCON_PD_Pos               (28)                                              /*!< CLK_T::APLLCON: PD Position            */
#define CLK_APLLCON_PD_Msk               (0x1ul << CLK_APLLCON_PD_Pos)                     /*!< CLK_T::APLLCON: PD Mask                */

#define CLK_APLLCON_BYPASS_Pos           (29)                                              /*!< CLK_T::APLLCON: BYPASS Position        */
#define CLK_APLLCON_BYPASS_Msk           (0x1ul << CLK_APLLCON_BYPASS_Pos)                 /*!< CLK_T::APLLCON: BYPASS Mask            */

#define CLK_APLLCON_RESETN_Pos           (30)                                              /*!< CLK_T::APLLCON: RESETN Position        */
#define CLK_APLLCON_RESETN_Msk           (0x1ul << CLK_APLLCON_RESETN_Pos)                 /*!< CLK_T::APLLCON: RESETN Mask            */

#define CLK_APLLCON_PLL_STB_Pos          (31)                                              /*!< CLK_T::APLLCON: PLL_STB Position       */
#define CLK_APLLCON_PLL_STB_Msk          (0x1ul << CLK_APLLCON_PLL_STB_Pos)                /*!< CLK_T::APLLCON: PLL_STB Mask           */

#define CLK_UPLLCON_FB_DV_Pos            (0)                                               /*!< CLK_T::UPLLCON: FB_DV Position         */
#define CLK_UPLLCON_FB_DV_Msk            (0x7ful << CLK_UPLLCON_FB_DV_Pos)                 /*!< CLK_T::UPLLCON: FB_DV Mask             */

#define CLK_UPLLCON_IN_DV_Pos            (7)                                               /*!< CLK_T::UPLLCON: IN_DV Position         */
#define CLK_UPLLCON_IN_DV_Msk            (0x3ful << CLK_UPLLCON_IN_DV_Pos)                 /*!< CLK_T::UPLLCON: IN_DV Mask             */

#define CLK_UPLLCON_OUT_DV_Pos           (13)                                              /*!< CLK_T::UPLLCON: OUT_DV Position        */
#define CLK_UPLLCON_OUT_DV_Msk           (0x7ul << CLK_UPLLCON_OUT_DV_Pos)                 /*!< CLK_T::UPLLCON: OUT_DV Mask            */

#define CLK_UPLLCON_FRAC_Pos             (16)                                              /*!< CLK_T::UPLLCON: FRAC Position          */
#define CLK_UPLLCON_FRAC_Msk             (0xffful << CLK_UPLLCON_FRAC_Pos)                 /*!< CLK_T::UPLLCON: FRAC Mask              */

#define CLK_UPLLCON_PD_Pos               (28)                                              /*!< CLK_T::UPLLCON: PD Position            */
#define CLK_UPLLCON_PD_Msk               (0x1ul << CLK_UPLLCON_PD_Pos)                     /*!< CLK_T::UPLLCON: PD Mask                */

#define CLK_UPLLCON_BYPASS_Pos           (29)                                              /*!< CLK_T::UPLLCON: BYPASS Position        */
#define CLK_UPLLCON_BYPASS_Msk           (0x1ul << CLK_UPLLCON_BYPASS_Pos)                 /*!< CLK_T::UPLLCON: BYPASS Mask            */

#define CLK_UPLLCON_RESETN_Pos           (30)                                              /*!< CLK_T::UPLLCON: RESETN Position        */
#define CLK_UPLLCON_RESETN_Msk           (0x1ul << CLK_UPLLCON_RESETN_Pos)                 /*!< CLK_T::UPLLCON: RESETN Mask            */

#define CLK_UPLLCON_PLL_STB_Pos          (31)                                              /*!< CLK_T::UPLLCON: PLL_STB Position       */
#define CLK_UPLLCON_PLL_STB_Msk          (0x1ul << CLK_UPLLCON_PLL_STB_Pos)                /*!< CLK_T::UPLLCON: PLL_STB Mask           */

#define CLK_PLLSTBCNTR_PLLSTBCNT_Pos     (0)                                               /*!< CLK_T::PLLSTBCNTR: PLLSTBCNT Position  */
#define CLK_PLLSTBCNTR_PLLSTBCNT_Msk     (0xfffful << CLK_PLLSTBCNTR_PLLSTBCNT_Pos)        /*!< CLK_T::PLLSTBCNTR: PLLSTBCNT Mask      */

