yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/clk_reg.h
#define CLK_STOPREQ_CANFD0STR_Pos        (0)                                               /*!< CLK_T::STOPREQ: CANFD0STR Position     */
#define CLK_STOPREQ_CANFD0STR_Msk        (0x1ul << CLK_STOPREQ_CANFD0STR_Pos)              /*!< CLK_T::STOPREQ: CANFD0STR Mask         */

#define CLK_STOPREQ_CANFD1STR_Pos        (1)                                               /*!< CLK_T::STOPREQ: CANFD1STR Position     */
#define CLK_STOPREQ_CANFD1STR_Msk        (0x1ul << CLK_STOPREQ_CANFD1STR_Pos)              /*!< CLK_T::STOPREQ: CANFD1STR Mask         */

#define CLK_STOPREQ_CANFD2STR_Pos        (2)                                               /*!< CLK_T::STOPREQ: CANFD2STR Position     */
#define CLK_STOPREQ_CANFD2STR_Msk        (0x1ul << CLK_STOPREQ_CANFD2STR_Pos)              /*!< CLK_T::STOPREQ: CANFD2STR Mask         */

#define CLK_STOPREQ_CANFD3STR_Pos        (3)                                               /*!< CLK_T::STOPREQ: CANFD3STR Position     */
#define CLK_STOPREQ_CANFD3STR_Msk        (0x1ul << CLK_STOPREQ_CANFD3STR_Pos)              /*!< CLK_T::STOPREQ: CANFD3STR Mask         */

#define CLK_STOPACK_CANFD0STA_Pos        (0)                                               /*!< CLK_T::STOPACK: CANFD0STA Position     */
#define CLK_STOPACK_CANFD0STA_Msk        (0x1ul << CLK_STOPACK_CANFD0STA_Pos)              /*!< CLK_T::STOPACK: CANFD0STA Mask         */

#define CLK_STOPACK_CANFD1STA_Pos        (1)                                               /*!< CLK_T::STOPACK: CANFD1STA Position     */
#define CLK_STOPACK_CANFD1STA_Msk        (0x1ul << CLK_STOPACK_CANFD1STA_Pos)              /*!< CLK_T::STOPACK: CANFD1STA Mask         */

#define CLK_STOPACK_CANFD2STA_Pos        (2)                                               /*!< CLK_T::STOPACK: CANFD2STA Position     */
#define CLK_STOPACK_CANFD2STA_Msk        (0x1ul << CLK_STOPACK_CANFD2STA_Pos)              /*!< CLK_T::STOPACK: CANFD2STA Mask         */

#define CLK_STOPACK_CANFD3STA_Pos        (3)                                               /*!< CLK_T::STOPACK: CANFD3STA Position     */
#define CLK_STOPACK_CANFD3STA_Msk        (0x1ul << CLK_STOPACK_CANFD3STA_Pos)              /*!< CLK_T::STOPACK: CANFD3STA Mask         */

/**@}*/ /* CLK_CONST */
/**@}*/ /* end of CLK register group */
/**@}*/ /* end of REGISTER group */

#if defined ( __CC_ARM   )
#pragma no_anon_unions
#endif

#endif /* __CLK_REG_H__ */
